package com.utotech.iper.Utils;

import android.annotation.SuppressLint;
import android.widget.TextView;

public class AppHelpAdd {
    @SuppressLint("SetTextI18n")
    public void addTheText(TextView textView) {
        textView.setText("سلام و شادباش ، عضویت شمارو به جمع ژوژمانی ها تبریک میگیم حضور شما اینجا اتفاقی نیست فرکانس وارتعاش ثروت داشتید، ولذا دراین جمع عظیم قرار گرفتید... \n" +
                "این نرم\u200Cافزار، تنها نرم افزار عملی است که باصرف مطالعه وتحقیق ده ها کتاب به شیوه ای بسیار کاربردی وآسان و بسیار حرفه ای ،ساخته شده است. \n" +
                "\n" +
                "همه می دانیم که همه رخدادها به واسطه قوانین فیزیک و متافیزیک، و ارتعاشات و فرکانس\u200Cهاییست که باعث میشوند مدارهایی همسان یکدیگر را جذب کنند،  لذا اینکه ما در چه فرکانسی قرار بگیریم خوشبختانه، بدست خودمان اتفاق میافتد وخلق میشود، بنابراین سلامتی، شادی، ثروت و... را خودمان با قرار گرفتن در ارتعاشات وفرکانس هایی خاص که به واسطه ورودی های ذهن جذب کرده ایم اتفاق افتاده اند... \n" +
                "\n" +
                "بنابراین تنها چاره کار کنترل ورودی هاست هرچند که این موضوع را همه اشراف دارند ولی چون درعمل نتوانسته اند کنترلی جدی بر ورودی های ذهن داشته باشند، نتوانسته اند تحولی در زندگیشان ایجاد بکنند. \n" +
                "طبق تحقیقات رسمی انجام شده انسان ها بیشترین وقت خود را با گوشی های موبایلشان بسر می\u200Cکنند حداقل 8ساعت درشبانه روز، بطور مستقیم ازموبایلشان استفاده می\u200Cکنند، لذامیتوان گفت، موبایل تنها وسیله\u200Cایست که همیشه و حتی، تا هنگام خواب همراه هر انسانی هست، بنابراین میتواند بیشترین تاثیر  را به ورودی ها را به  ذهن ما بدهد واز این رو،   این نرم افزار با طراحی وانتخاب جملاتی انگیزشی و هدفمند، \n" +
                "این امر مهم را به نحو بسیار عالی برایمان انجام خواهد داد...\n" +
                "\n" +
                " در طول روز مشغول امورات روزمره هستید، که ناخودآگاه جملات مثبت وانگیزشی، بطور خودکار، فرکانسی مثبت  را ، به روی گوشی شما خواهد فرستاد ، همین که با چشم ميبينيد حافظه ی تصویری ذهن را در گیر خواهد کرد، و بطور ناخودآگاه متن را در ذهن، خواهید خواند و بدینگونه ما بمرور با ارسال این ورودی های مثبت، باعث افزایش سطح فرکانس وارتعاش خود خواهیم شد.\n" +
                "\n" +
                "این نرم افزار  باید برای همیشه و همیشه، در موبایلتان داشته باشید\n" +
                "تا ورودی های مثبت ، هزاران وهزاران، و حتی میلیونها بار تکرار بشود و بمرور باعث از بین رفتن فرکانس وافکار منفی گذشته بشود  ، و آنرا با فرکانس های مثبت جایگزین، و سپس تثبیت کنیم.\n" +
                "\n" +
                "واما تمریناتی بسیار قدرتمند و عملی هم، در نظر گرفته شده که صبح بمحض بیدار شدن ازخواب و آخرشب قبل از خواب انجام خواهید داد.\n" +
                "  هرچند که در خود نرم افزار همه تمرینات کامل انجام میشه، ولی عده\u200Cای از افراد شاید دوست داشته باشند. \n" +
                "به شیوه ملموس\u200C، و فیزیکی تمرینات را انجام بدهند، بنابراین این عده از دوستان\n" +
                "باید یک دفترخریداری کنند واسمش را بگذارید، دفترتمرین ژوژمان ثروت،  دونکته\u200C ی ریز ولی بسیار مهم وجود دارد که اگر رعایت نکنید، انگار هیچ کاری نکرده اید، وآن اینکه : با حوصله و دقت بنویسیدو از شلخته نویسی پرهیز کنید چون باعث ايجاد ارتعاش منفی میشود و نکته دوم، حتما باید ایجاد احساس خوب بشود و در اصل همین همیشه ماندن در حال وارتعاش خوب است که باعث جذب میشود و نتایج فوق\u200Cالعاده را ایجاد می کند ، لذا حتما حس وحال خوب را باید داشته باشید. \n" +
                "\n" +
                "⛔️برای انجام تمرینات نوشتنی صبح یا شب، از همین ابتدا تصمیمی قاطع بگیرید چون فقط وفقط، باید روی يکی از آنها تمرکز کنید،یا انجام در نرم افزار، ویا ثبت پاسخ ها در دفترتان، مثلا اگر خواستید در دفتر بنویسید، حتی در سفر هم باید همراه داشته باشید... \n" +
                "_ _ _ _ _ _ _\n" +
                "بمباران ورودی ذهن با جملات انگیزشی  مثبت، هدف اصلی این نرم افزار است، سعی کنید فرکانس وارتعاش حال خوب، را همیشه حفظ کنید. \n" +
                "\n" +
                "نکته قوت این نرم افزار این است که، شما اگر  پیش هر کدام از اساتید انگیزشی هستید، ویا دوره ای را فراگرفته اید، ویا در هر حوزه ای که  خودتان بخواهید تمرینات را انجام بدهید،  \n" +
                "نرم\u200Cافزار، طوری طراحی شده که می توانید، سوالات تمرینی \uD83D\uDC48صبح و شب\uD83D\uDC49 را به دلخواه خود و با هدف ویژه خودتان، ویرایش کرده و تغییر بدهید. \n" +
                "\n" +
                "شاد ، سلامت وثروتمند باشید.\n" +
                "_ _ _ _ _ _ _  _\n" +
                "\n" +
                "\uD83D\uDD34نکته:\n" +
                " بهیچ عنوان رضایتی، از ( نَشر رایگان ، = شَیر کردن ) نرم افزار را نداریم، \n" +
                "لذا بخاطر موفقیت خودتان هم شده، جدا رعایت بفرمایید تا \n" +
                "عواقب (کارمای) عَملتان گریبانگیر زندگیتان نشود .");
    }


}
