package com.utotech.iper.Utils;

import static android.content.Context.MODE_PRIVATE;

import android.content.Context;
import android.content.SharedPreferences;

import android.media.MediaPlayer;
import com.utotech.iper.R;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Shared {
    public static SharedPreferences.Editor editor;
    public static SharedPreferences prefs;
  //  public static List<String> qSentences;

    public static void writeShared(String status, Context context, String id) {

        editor = context.getSharedPreferences("statustbl", MODE_PRIVATE).edit();
        editor.putString("status", status);
        if (status.equals("edit")) {
            editor.putString("id", id);
        }
        editor.apply();
    }

    public static void writeIndexPractice(String i, Context context, String status) {
        if (status.equals("morning")) {
            editor = context.getSharedPreferences("practiceMorningTbl", MODE_PRIVATE).edit();
            editor.putString(status, i);
            editor.apply();

        } else if (status.equals("night")) {
            editor = context.getSharedPreferences("practiceNightTbl", MODE_PRIVATE).edit();
            editor.putString(status, i);
            editor.apply();
        }
    }

    public static void writeAppSetting(Context context, String settingName, String settingValue) {
        final String TABLE_NAME = "settingTbl";

        editor = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE).edit();
        editor.putString(settingName, settingValue);
        editor.apply();

    }

    public static String readAppSetting(Context context, String settingName) {
        final String TABLE_NAME = "settingTbl";
        String result;
        switch (settingName) {
            case "appIsActivated":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "off"); // off is default value
                break;
            case "clickSound":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "on");
                break;

            case "notification":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "on");
                break;

            case "fontName":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "suls.ttf");
                break;
            case "fontToastyName":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "suls.ttf");
                break;
            case "fontSize":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "15");
                break;

            case "toastyTheme":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "FF6200EE");
                break;
            case "toastyTxtTheme":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "FF6200EE");
                break;
            case "fontToastySize":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "15");
                break;
            case "whenTo":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "5");
                break;
            case "qSentenceIndex":
                prefs = context.getSharedPreferences(TABLE_NAME, MODE_PRIVATE);
                result = prefs.getString(settingName, "0");
                break;
            default:
                result = "defffult";
                break;

        }

        return result;
    }

    public static String readShared(Context context, String requestedItem, String status) {
        switch (requestedItem) {
            case "id":
                prefs = context.getSharedPreferences("statustbl", MODE_PRIVATE);
                return prefs.getString("id", null);
            case "morning":
                prefs = context.getSharedPreferences("practiceMorningTbl", MODE_PRIVATE);
                return String.valueOf(prefs.getString(status, ""));
            case "night":
                prefs = context.getSharedPreferences("practiceNightTbl", MODE_PRIVATE);
                return String.valueOf(prefs.getString(status, ""));
            default:
                prefs = context.getSharedPreferences("statustbl", MODE_PRIVATE);
                return prefs.getString("status", null);
        }

    }

    public static void writeQuestions(Context context, String whichQusetion, int questionIndex, String newQuestion) {
        switch (whichQusetion) {
            case "morning":
                editor = context.getSharedPreferences("morningPracticeTable", MODE_PRIVATE).edit();
                editor.putString("morningQuestion".concat(String.valueOf(questionIndex)), newQuestion);
                editor.apply();
                break;
            case "night":
                editor = context.getSharedPreferences("nightPracticeTable", MODE_PRIVATE).edit();
                editor.putString("nightQuestion".concat(String.valueOf(questionIndex)), newQuestion);
                editor.apply();
                break;
            case "reset":
                editor.clear().apply();
                break;
        }
    }

    public static List<String> getQuestions(Context context, String whichQuestions) {
        List<String> result = new ArrayList<>();

        switch (whichQuestions) {
            case "morning":
                prefs = context.getSharedPreferences("morningPracticeTable", MODE_PRIVATE);
                for (int i = 0; i < 7; i++) {
                    String lable = "morningQuestion".concat(String.valueOf(i));
                    result.add(prefs.getString(lable, morningQustions.get(i)));
                }
                break;
            case "night":

                prefs = context.getSharedPreferences("nightPracticeTable", MODE_PRIVATE);
                for (int i = 0; i < 7; i++) {
                    String lable = "nightQuestion".concat(String.valueOf(i));
                    result.add(prefs.getString(lable, nightQusetions.get(i)));
                }

                break;

        }

        return result;
    }

    public final static List<String> nightQusetions = Arrays.asList("آیا واقعا کاری که قرار بود انجام بدهم را انجام دادم؟ بنویس",
            "چه کار هایی رو باید فردا انجام بدهم؟", "از نمره 1 تا 10 چه نمره ای به خودم میدهم؟ دلیلش را بنویس",
            "چگونه فردا میتوانم بهتر باشم؟ بنویسم", "امروز چه اتفاق جالبی برایم افتاد؟ و حس خوب ایجاد کرد؟",
            "امروز چه ایده جالبی به ذهنم رسید؟ بنویس", "برای چه چیز هایی و چه کسانی سپاسگذار خداوند هستم؟");


    public final static List<String> morningQustions = Arrays.asList("به خاطر چه چیزی سپاسگذار خداوند هستم؟",
            "به خاطر چه کسی سپاسگذار خداوند هستم؟", "هدف اصلی امسالم چیست؟",
            "امروز برای رسیدن به هدفم چه کاری میکنم؟", "امروز اگر بتوانم فقط سه کار انجام بدهم چیست؟",
            "دوست دارم خداوند چه کار هایی برایم انجام بدهد؟", "چشمان خود را 68 ثانیه بسته، با لذت و شعف بسیار هدف خود را تجسم کنید و روی دکمه شروع کلیک کنید ");

    public final static List<Integer> RESOURCES_LIST = Arrays.asList(R.drawable.bigfkr, R.drawable.gorg,
            R.drawable.richfather, R.drawable.fourasar, R.drawable.moneyintel,
            R.drawable.purple_cow, R.drawable.thinnkmoney, R.drawable.mycheese,
            R.drawable.eatyourfrog, R.drawable.nimetarik, R.drawable.mirklofthanksgiving,
            R.drawable.qodrat, R.drawable.royaha, R.drawable.richestbabelman, R.drawable.magic_of_partime);

    public static List<String> titles = Arrays.asList(
            "قانون فرکانس چیست (قانون جذب)", "از لحاظ علمی: قانون جذب یک واقعیت است نه یک توهم",
            "منظور از جهان فرکانسیک چیست؟!", "اشاره قرآن کریم به قانون فرکانس", "رشد مالی",
            "انرژی\u200Cها و امواج اینگونه بر زندگی\u200Cمان تاثیر شگرف می گذارند",
            "انرژی، فرکانس، ارتعاش، امواج", "کلام آخر", "قانون ارتعاش چیست؟", "ارتعاش در قانون جذب مانند دکل است", "تفاوت ارتعاش قانون جذب با ارتعاش دکل مخابراتی ",
            "استفاده از ارتعاش قانون جذب در جهت عکس", "آیا با قانون جذب می توان به خواسته ها رسید؟",
            "قانون جذب و قانون ارتعاش", "ارتباط قانون جذب و قانون ارتعاش",
            "چه چیزی مانع فرستادن ارتعاش مثبت به کائنات می شود؟", "قانون جذب 68ثانیه... "
    );

    public static List<String> content = Arrays.asList(
            "قبل از اینکه وارد دنیای قانون جذب شوید باید بدانید که میتوانید آن را در زندگیتان بکارببرید و این میتواند از راه صحیح به زندگی شما تاثیربگذارد. جنبش اندیشه نو از آموزه\u200Cهای فینیاس کویمبی در اوایل قرن نوزدهم شروع شد. وی در اوایل زندگی، به بیماری سل مبتلا شد. متأسفانه درمان دارویی جواب نداد، بنابراین تصمیم گرفت تا از وطنش، لبنان به نیو همسفیر برود. او سلامت خود را بازیافت و بهبود یافت. وی مطالعهٔ مبحث ذهن در برابر بدن را آغاز کرد. اگرچه او هرگز از واژهٔ قانون جذب استفاده ننمود، اما توصیفات پایهٔ او مشابه بود. در پایان قرن نوزدهم، این واژه توسط نویسندگان جنبش اندیشه نو به کار گرفته شد. مانند پرنتایس مالفورد و رالف والدو تراین، اما برای آن\u200Cها قانون جذب نه فقط بر سلامت، بلکه بر تمام جوانب زندگی تأثیر می\u200Cگذاشت.\n" +
                    "این موضوع در قرن بیستم بسیار مورد توجه قرار گرفت و در کتاب\u200Cهای زیادی به بحث گذاشته شد که برخی از آن\u200Cها جزو پر فروش\u200Cترین کتاب\u200Cهای تاریخ می\u200Cباشند؛ فکر کنید و ثروتمند شوید -۱۹۳۷- نوشتهٔ ناپلئون هیل و شما می\u200Cتوانید خود را شفا دهید -۱۹۸۴- نوشتهٔ لوئیس هِی. در سال ۲۰۰۶، با انتشار فیلم راز، قانون جذب توجه زیادی را به خود جلب نمود. در سال ۲۰۰۷ این فیلم به صورت کتاب نیز چاپ شد. این فیلم و کتاب توجه زیادی را در رسانه\u200Cها به خود جلب کردند. کتاب روندا برن نیز تأثیر زیادی بر خلق فیلم سینمایی راز، با بازی کیتی هولمز داشت. قوانین اصلی قانون جذب را میتوان در بسیاری از آموزه های فرهنگی و گروههای مذهبی هم پیدا کرد و این قانون محدودیت سنی، مذهبی، ملیت و… ندارد.",
            "کارهای فیزیکدانان کوانتوم در سالهای اخیر، کمک زیادی به تاثیرات باورنکردنی قدرت ذهن در زندگیمان و به طور کلی در جهان کرده است. بیشتر این ایده ها توسط دانشندان و اندیشمندان مورد بررسی قرار گرفته است که باعث درک بیشتر از تاثیر افکار بر شکل گیری زندگی و جهان اطرافمان کرده است. فیزیکدانان بدون در نظر گرفتن این قانون، اطلاعات بیشتر و بیشتری به ما میدهند و به ما قدرت تشخیص میدهند که باور کنیم که خود ما سازنده و کنترل کننده زندگیمان هستیم. از اینکه جهان همیشه در کنار ماست خوشحال باشید و بدانید که در مورد این قانون هیچ محدودیتی وجود ندارد. پس ذهنتان را باز کنید و از فراوانی های طبیعت لذت ببرید.",
            "هر انسانی به واسطه گفتار، رفتار و افکارش یک سری فرکانس از خود ساطع می کند ( قانون فرکانس ) که سبب ورود آن به جهان های فرکانسیکی می شود و در آن جهان همه چیز با آن شخص هم فرکانس است.برای روشن شدن این موضوع در ادامه برای شما مثالی آوردیم.\n" +
                    "اگر بر فرض مثال فرکانس شما در حال حاضر ۱۳۰۰ باشد، شما فقط موقعیت ها، انسان ها و به طور کلی شرایطی را مشاهده می کنید که فرکانس آن ها ۱۳۰۰ است و با شرایط دیگر با فرکانس های متفاوت دیگر ارتباط ندارید.\n" +
                    "انسان ها تعیین کننده فرکانس خود بر اساس رفتار، افکار و گفتار خود هستند (قانون جذب)\n" +
                    "۱ – افرادی که مدام در فکر این هستند که افراد حقه باز و عوضی شده اند، این شخص خود در فرکانس انسان های عوضی قرار دارد.\n" +
                    "۲ – کسی که فکر می کند پول در آوردن خیلی سخت است، هیچ وقت توی فرکانس آدم هایی که پول را راحت در می آورند قرار نمی گیرد؛ چون فرکانس آن شخص با فرکانس آدم هایی که به راحتی پول در می آورند یکسان نیست.\n" +
                    "۳ – کسی که فکر می کند امکان ندارد همسر خوب پیدا کند، هیچ وقت فرکانس آن با یک شخص خوب برای همسری یکسان نمی شود.\n" +
                    "اگر قصد شناخت کسی را دارید باید براساس قانون فرکانس او را با دوستان و همنشینان خود از طریق این قانون بسنجید. پس برای شناخت یک شخص، شناخت اطرافیان و کسانی که با آن ها ارتباط زیادی دارد، بسیار مهم است. ولی نکته جالب اینجاست که ما در هزاران دنیای فرکانسی زندگی می کنیم. دنیای سلامتی، دنیای ثروت، دنیای علم، دنیای پیشرفت، دنیای وقت گذرانی و…\n" +
                    "شاید دانستن این نکته برای شما بسیار جالب باشد که شما با همسر، مادر، پدر، فرزند و به طور کلی سایر افرادی که با آن ها ارتباط زیادی دارید، هم فرکانس هستید و اگر فرکانس شما و یا آن ها تغییر کند دیگر با یکدیگر ارتباط زیادی نخواهید داشت.",
            "در قرآن کریم نیز آیات بسیاری در خصوص قانون فرکانس بیان شده که در ادامه به چند مورد اشاره می کنیم:\n" +
                    "۱ – آیه ۲۶ سوره نور که می فرماید: الْخَبیثاتُ لِلْخَبیثینَ وَ الْخَبیثُونَ لِلْخَبیثاتِ وَ الطَّیِّباتُ لِلطَّیِّبینَ وَ الطَّیِّبُونَ لِلطَّیِّباتِ. بدین معنی است که خداوند زنان آلوده را برای مردان آلوده و مردان آلوده را برای زنان آلوده و همچنین زنان پاک را برای مردان پاک و مردان پاک را برای زنان پاک قرار داده است.\n" +
                    "از تفسیر این آیه متوجه می شویم که تنها افراد هم فرکانس برای زندگی در کنار هم مناسب هستند.\n" +
                    "۲ – آیات ۷ و ۸ سوره زلزال: فَمَنْ یعْمَلْ مِثْقالَ ذَرَّةٍ خَیراً یرَهُ (۷) وَ مَنْ یعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا یرَهُ (۸)\n" +
                    "اگر کسی به اندازه ای عمل و کار خیری کرده باشد نتیجه آن را می بیند (۷) و اگر کسی به اندازه ای کار شر کرده باشد جزای آن را هم خواهید دید.\n" +
                    "برخی از ما فکر می کنیم اگر زمانی رفتاری، گفتاری و یا حتی کار ناشایستی مرتکب شویم و یا حتی افکار منفی داشته باشیم، فقط به همان لحظه برمی گردد. در صورتی که با توجه به این آیه و بر اساس قانون فرکانس، این رفتار آن قدر در این دنیای هستی برمی گردد، تا اعمالی هم فرکانس با خود را پیدا کند و آن را جذب نماید.\n" +
                    "۳ – آیه ۱۸۶ سوره بقره: وَإِذَا سَاءَلَکَ عِبَادِی عَنِّی فَإِنّی قَرِیبٌ اءُجِیبُ دَعْوَهَ الْدَّاعِ إِذَا دَعَانِ فَلْیَسْتَجِیبُواْ لِی وَ لْیُؤ مِنُوا بِی لَعَلَّهُمْ یَرْشُدُونَ\n" +
                    "زمانی که بندگانم درباره\u00ADی تو از من سوال کنند، (بگو) همانا من نزدیک ترین هستم و دعاهای نیایشگر را آن گاه که مرا می خواند پاسخ می دهم، پس باید دعوت من را بپذیرند و به من ایمان آورند.\n" +
                    "این آیه در خصوص قانون فرکانس بیان شده و اولین مرحله این قانون را درخواست از نیروی لایزال الهی بیان می کند. در اینجا خواسته خود را با تمام وجود از کائنات می خواهیم. بر اساس قانون فرکانس این خواسته در دنیای هستی به جستجوی هم فرکانس خود می گردد، تا آن را جذب نماید. پس هرچه قدر خواسته خود را از صمیم قلب و با شور و اشتیاق بیشتری از خدا بخواهیم فرکانس این دعا بالاتر بوده و زودتر به خواسته خود می رسیم.\n" +
                    "\n" +
                    "اشعار زیبا در مورد قانون فرکانس (قانون جذب)\n" +
                    "\n" +
                    "جملات بسیار زیبایی نیز در خصوص قانون فرکانس بیان شده که در ادامه به چند مورد از آن ها اشاره خواهیم کرد:\n" +
                    "\n" +
                    "کبوتر با کبوتر باز با باز، کند هم جنس با هم جنس پرواز\n" +
                    "\n" +
                    "ذره ذره کاندرین ارض و سماست، جنس خود را هر یکی چون کهرباست (مولانا در کتاب مثنوی چقدر زیبا قانون فرکانس را بیان کرده است)\n" +
                    "\n" +
                    "خوب، خوبی را کند جذب این بدان، طیبات و طیبین بر وی بخوان\n" +
                    "\n" +
                    "ناریان مر ناریان را جاذب اند، نوریان مر نوریان را طالب اند\n" +
                    "\n" +
                    "در جهان هر چیز چیزی جذب کرد، گرم گرمی را کشید و سرد سرد",
            "همان طور که گفتیم باورهای زیادی در خصوص قانون فرکانس بیان شده است. یکی دیگر از این باورها به باورهای مالی و مسائل مربوط به آن اشاره دارد. اگر شخصی به این فکر باشد که در آینده وضع مالی خوبی پیدا می کند. به این افکار امید داشته باشد و آن را در خود تقویت کند، مطمئناً بر اساس قانون جذب پولدار می شود. چون همواره چیزهای مشابهی که تصور می شود یکدیگر را جذب می کنند؛ و اگر هم فردی مخالف این تفکر باشد که نمی تواند وضع مالی خوبی داشته باشد، دائماً به این فکر می کند که نمی شود، نمی تواند و… این افکار منفی بر اساس قانون جذب نمی گذارد شخص وضع مالی خود را بهتر کند.",

            "انرژی تمام نمی شود. زیاد یا کم هم نمی شود. از حالتی به حالت دیگر در می آید. آیا غذایی که می خوریم انرژی خوبی دارد یا بد؟ آدم های اطراف مان چه طور؟ انرژی می دهند یا انرژی می گیرند؟ واژه هایی که در ذهن خودمان به کار می بریم چه تغییری در سطح انرژی بدن مان می دهد؟ آیا انرژی مثبت بفرست مبنای علمی دارد یا دل خوش کنکی در دنیای پر دغدغه امروز است؟\n" +
                    "حتما شما هم تا حالا از این جمله ها زیاد شنیده اید؟ موج منفی می فرستد، انرژی مثبت بفرستید، ما ارتعاشات مان یکی است.\n" +
                    "جمله هایی که این روزها زیاد می شنویم و پر بی راه هم نیست. وقتی همه چیز در دنیا از مولکول تشکیل می شود و مولکول هم دارای جنبش و حرکت است این جملات کاملا درست است. فقط طی دو سه سال اخیر نگاه علمی تری به آن شده است.\n" +
                    " \n" +
                    "\n" +
                    "همه چیز از مولکول شروع می شود\n" +
                    "\n" +
                    "\n" +
                    "بدن ما و تمام آن چه در دنیا است و غذاهایی که می خوریم ازمولکول ها تشکیل شده است. مولکول های بدن ما پروتئین ها، کربوهیدرات ها و اسیدنوکلئیک ها هستند که از نوع مولکول های پیچیده محسوب می شوند. مولکول هایی که در مواد غذایی هم یافت می شود.\n" +
                    "مولکول ها از اتم ها درست شده اند. اتم ها از نوترون، پروتون و الکترون. الکترون ها به دلیل داشتن میدان مغناطیسی حول همین میدان به دور هسته می گردند و مدام در جنب وجوش هستند. مولکول آب وقتی حرارت ببیند حرکت الکترون ها سرعت می گیرد و وقتی یخ می زند حرکت الکترون ها کند می شود. پس عواملی می تواند بر حرکت الکترون ها تاثیر بگذارد. بجز دما میدان های مغناطیسی باعث انحراف مسیر حرکت الکترون ها می شود.\n" +
                    "ماساروایموتو ژاپنی هم همین چندسال پیش آزمایشات جالبی بر روی مولکول های آب انجام داد. ایموتو با انتشار عکس هایی معتقد بود ملکول های آب تحت تاثیر واژه های خوب یا واژه های بد قرار می گیرند و شکل شان هماهنگ و زیبا ( تحت تاثیرکلام مثبت) یا ناهماهنگ (تحت تاثیر واژه های منفی) می شود. او برای اثبات ادعایش پس از قراردادن مولکول های آب درمعرض انرژی کلمات آن ها را منجمد می کرد و سپس عکس می گرفت. هر چند با مرگ او در سال ۲۰۱۴ نظریه اش با قطعیت به اثبات نرسید ولی این که بر اثر عواملی مثل دما شکل مولکول ها تغییر می کند بر هیچ عکس پوشیده نیست.",
            "راه های مختلفی برای اندازه گیری انرژی وجود دارد. اولین تعریف را اینشتین ارائه کرد : ” هر چیزی در زندگی یعنی ارتعاش.” و قانون معروف خود را در مورد اندازه گیری انرژی ارائه کرد.\n" +
                    "نیکولا تسلا Nicola Tesla مجارستانی که مدتی هم با ادیسون همکاری کرد، گفته معروفی دارد: “اگر می خواهید راز جهان را کشف کنید به دنبال معنای واژه های انرژی، فرکانس و ارتعاش بگردید.”\n" +
                    "دکتر آز Dr. Oz مشهور هم اعتقاد دارد طب آینده طب انرژی است. هم اکنون هم از انرژی امواج، فرکانس و ارتعاش در پزشکی امروز استفاده می شود. سونوگرافی، جراحی با لیزر، نوار قلب و مغز نمونه های خوب و نام آشنای آن است.\n" +
                    "بروس تینو Bruce Tyno از دانشگاه واشنگتن آمریکا اخیرا موفق شده است تا فرکانس یا بسامد الکترومغناطیس اطراف بدن انسان، دورو بر غذاها و بسیاری از چیزهای دیگر را به هرتز اندازه گیری کند.\n" +
                    "او توانسته اندازه گیری کند بدن یک انسان سالم بین ۶۲ تا ۶۸ هرتز فرکانس دارد. بدن بیماران مبتلا به سرطان را که در مراحل آخر بیماری بودند با اندازه ۲۴ هرتز به دست آورد.\n" +
                    "فرکانس بدن بیماران مبتلا به باکتری کاندیدای دستگاه گوارش عدد ۵۰ هرتز را نشان می داد. افراد مبتلا به ویروس Epstein-Barr هم بدن شان فرکانسی بین ۵۰ تا ۵۲ هرتز داشت.\n" +
                    "سال ها است علم ثابت کرده است انرژی از حالتی به حالتی دیگر در می آید و از بین نمی رود.\n" +
                    "فیزیک کوانتوم هم ثابت کرده است اگر دو ماده با فرکانس متفاوت در کنار یک دیگر قرار گیرند ماده ای که دارای فرکانس بیشتر است بر ماده ای که فرکانس کمتر دارد تاثیر گذاشته فرکانس آن را بیشتر می کند.\n" +
                    "قوانین معروف نیوتن هم که دیگر جای بحث ندارد و قانون عمل و عکس العمل با موضوع مقاله ما در ارتباط است.\n" +
                    "پس انرژی همه جا هست فقط از حالتی به حالت دیگر در می آید و با روش های مختلف باید اندازه گیری شود که شاید بعضی از آن ها را تاکنون کشف نکرده ایم.",
            "آن چه رابین می گوید حداقل با علم امروز جور در می آید. همه چیز از مولکول تشکیل شده است و مولکول ها دارای الکترون هایی هستند که با سرعتی خاص دور هسته می گردند. خارج شدن حرکت الکترون از سرعت طبیعی خودش باعث اغتشاش در آن می شود. این اغتشاش می تواند تحت تاثیر غذاها، دما و امواج دور و برمان تغییر کند. شاید آن جا که می گوید من حتی از واژه های بد استفاده نمی کنم درست باشد چون رزونانس یا طنین صدای خود فرد طبق قانون عمل و عکس العمل نیوتن می تواند باعث تغییر حرکت الکترون ها شود.\n" +
                    "انرژی تغییر نمی کند بلکه از حالتی به حالتی دیگر در می آید. انرژی ماده غذایی را می گیریم و آن را به انرژی مورد نیاز بدن تبدیل می کنیم. انرژی که از ماده غذایی می گیریم به چه تبدیل می کنیم؟ از دیگران چه انرژی می گیریم؟ خودمان به محیط اطراف مان چه انرژی می فرستیم؟\n" +
                    "حداقل شب ها دستگاه وای فای و تلفن همراه خود را خاموش کنیم. غذاها و فعالیت های بدنی سالم برای خودمان انتخاب کنیم. ساده از کنار فعالیت های روزانه خودمان و محیط و آدم های اطراف مان رد نشویم. مواظب انرژی هایی مثل وسایل الکترونیکی، موسیقی، تلفن همراه یا فرکانس بدن خودمان و اطرافیان مان یا فرکانس طنین صداهای مان باشیم که به سوی هم پرتاب می کنیم.\n" +
                    "یادتان باشد مغز نمی تواند در آن واحد به دو چیز فکر کند. اگر به منفی ها فکر کنید نمی توانید مثبت اندیش باشید. همیشه به مثبت ها فکر کنید تا نکات منفی جایی در ذهن شما نداشته باشند.",
            "قانون ارتعاش یکی از مهم ترین قوانین هستی است که با استفاده از آن می توانید از قانون ارتعاش برای رسیدن به تمام خواسته ها و آرزوهای خود استفاده کنید.\n" +
                    "مهمترین و اساسی ترین راز در قانون جذب ارتعاش است. برای رسیدن به خواسته هایتان باید ارتعاش اهداف و خواسته هایتان را به کائنات بفرستید.\n" +
                    "همانطور که گفتیم به زبان ساده قانون جذب یک قانون ثانویه در جهان است و قانون اساسی قانون ارتعاش است. منظور از قانون ارتعاش در قانون جذب، قرار گرفتن در مدار امیال و آرزوهاست.\n" +
                    "یکی از دلایلی که بسیاری از مردم کتاب های زیادی در مورد قانون جذب می خوانند، گذراندن دوره های زیادی در مورد قانون جذب است، اما به این نتیجه نرسند که معنای اصلی قانون ارتعاش را نمی دانند.\n" +
                    "اگر بتوانید افکار و ذهن خود را کاملاً کنترل کنید و ارتعاشات مثبتی را در جهت خواسته ها و آرزوهای خود به کائنات بفرستید، می توانید به هر آرزو و هدفی که دارید به ساده ترین شکل ممکن دست یابید.\n" +
                    "\n" +
                    "قانون ارتعاش چیست؟\n" +
                    "\n" +
                    "یکی از موضوعات مهم در قانون جذب بحث ارتعاش یا فرکانس است. زمانی که با مفهوم ارتعاش در قانون جذب آشنا شدید، می توانید نظر خود را تغییر دهید که چنین تصمیماتی و سپس اعمال شما تغییر می کند و در نتیجه نتایج جدیدی در زندگی خواهید گرفت.",
            "حتما همه شما این برج را در نزدیکی خانه خود دیده اید، این برج مخابراتی است که امواج ارتباطی بین تلفن های همراه را ارسال می کند.\n" +
                    "اما چند ویژگی وجود دارد که با هم بررسی می کنیم، هر موجی که از این دکل ها خارج می شود نیرویی دارد که با دور شدن از دکل کاهش می یابد.\n" +
                    "خیلی جاها به آنتن موبایل خود نگاه می کنید و می بینید که فقط چند خط آنتن آن پر است و گاهی آنتن به طور کامل قطع می شود زیرا این دکل ها یا در این مکان ها وجود ندارند یا در جایی که شما هستید. آنها قدرت کمی دارند و تلفن همراه شما نمی تواند به آنها وصل شود.\n" +
                    "یا وارد سیاهچال می شوید و آنتن موبایل شما قطع می شود زیرا موانع روی این موج تاثیر می گذارد.\n" +
                    "اما نوع دیگری از دکل وجود دارد که هر لحظه امواج را ارسال و دریافت می کند، آن شما هستید.\n" +
                    "در واقع بدن شما در هر لحظه با فرکانس های متفاوتی می لرزد و در نتیجه به خود بدن باز می گردد و این قانون جذب است که می گوید شما همان چیزی می شوید که اغلب متوجه آن می شوید.",
            "ارتعاش ساطع شده از دکل های مخابراتی برخی از محدودیت های فوق را دارد. مانند کاهش برق در فواصل طولانی از تاسیسات. از موانع عبور نکنید و …\n" +
                    "اما ارتعاشی که از بدن انسان ساطع می شود چنین محدودیتی ندارد و این یکی از سوالاتی است که دانشمندان درباره چگونگی ایجاد چنین ارتعاشی با چنین خواصی می پرسند.\n" +
                    "برای لحظه ای تصور کنید که به دنیای کارمایی ارل منتقل شده اید. ارتعاشات را در سرعت های بسیار بالا حس می کند.\n" +
                    "حالا او می تواند با شما تماس بگیرد یا در حضور دوستانتان در مورد آن بشنود یا هر چیز دیگری.\n" +
                    "ارتعاشی که توسط شما برای دوستتان ارسال می شود با همان نیرویی که از بدن شما خارج می شود توسط دوست شما احساس می شود، مهم نیست که چه موانعی بر سر راه وجود دارد، از همه آنها می گذرد.\n" +
                    "به خاطراتی که بارها و بارها براتون افتاده فکر کنید مثلا دلتون یه خورش سبزی میخواست که مامانتون زنگ زد گفت امروز درست کردم و میرم خونه. یا می خواستید یک مدل 206 سفید برای یک سال خاص بخرید و دقیقاً همان را بخرید.\n" +
                    "اینها نشانه هایی است که نشان می دهد از ارتعاش قانون جذب برای رسیدن به خواسته های خود استفاده کرده اید. و این قانون جذب است\n",
            "اما مواقع بسیاری پیش آمده که چیزی را در زندگیتان نمی خواستید، یا از آن فراری بوده اید یا در مقابل آن مقاومت می کردید اما بالاخره دچارش شدید، نمی خواستید مریض شوید که اتفاق افتاد، نمی خواستید تصادف کنید که اتفاق افتاد، نمی خواستید چکتان برگه بخورد که اتفاق افتاد\n" +
                    ". فرقی نمی کند به رسیدن به خواسته فکر کنید یا نرسیدن آن، در هر دو صورت به هر دو خواهید رسید.\n" +
                    "من از شما می پرسم در روز به چه چیزهایی اغلب فکر میکنید؟ به داشتن آرزوهایتان یا به مشکلات هر روزتان؟ از قانون جذب در چه جهتی استفاده می کنید؟\n",
            "آیا با قانون جذب میتوان به خواسته ها رسید؟ \n جواب یک کلمه است : بله \n آیا میتوان به خواسته ها نرسید؟ باز هم بله. \n  شما در هر جهتی که از قانون جذب استفاده کنید آن را در زندگی خود می بینید، کافیست توجهتان را بر روی خواسته هایتان قرار دهید، در مسیر آن شروع کنید به حرکت کردن و آنگاه خواهید دید که زودتر از انتظارتان اهدافتان به شما خواهند رسید. ",
            "قبل از اینکه با قانون ارتعاش در قانون جذب آشنا شوید بهتر است شما را با قانون جذب آشنا کنم.\n قانون جذب به زبان ساده به این معنی است که وقتی به چیزی فکر می کنید، آن را وارد زندگی شما می کنیم. طبق قانون جذب وقتی به جسمی فکر می کنیم آن را می بلعیم.\n" +
                    "قانون جذب همیشه مانند یک طناب عمل می کند، قانون جذب درست مانند یک طناب است که یک سر طناب به شما وصل است و سر دیگر آن به آنچه فکر می کنید. با طناب نمی توان چیزی را هل داد!\n" +
                    "وقتی به بی پولی، روابط بد، بیکاری و غیره فکر می کنید، پول، روابط بد و بیکاری را جذب می کنید. برعکس، وقتی به پول و ثروت فکر می کنید، پول و ثروت را به زندگی خود جذب می کنید.\n" +
                    "خیلی ها فکر می کنند قانون جذب واقعی نیست، اگر شما هم جزو آن دسته از افراد هستید و فکر می کنید که قانون جذب اصلا واقعی نیست، سخت در اشتباهید. دلیل اینکه شما از قانون جذب نتیجه نمی گیرید این است که نمی توانید ارتعاش و هدفی را که می خواهید به جهان هستی بفرستید.\n" +
                    "وقتی نمی دانید چگونه ارتعاش خواسته های خود را به کائنات بفرستید، باعث می شود ناخودآگاه ارتعاشات منفی را به کائنات بفرستید.\n" +
                    "وقتی ضمیر ناخودآگاه شما این ارتعاشات را به کیهان می فرستد، جهان با توجه به ارتعاشی که از شما دریافت خواهد کرد، چیزهای ناخواسته را وارد زندگی شما می کند.\n" +
                    "به همین دلیل است که باید آگاهانه خواسته های خود را به ارتعاش درآورید. می خواهم به شما بگویم که قانون جذب دقیقاً درست است و اگر به این قانون اعتقاد داشته باشید و بتوانید به درستی از آن استفاده کنید، نتایج بسیار خوبی خواهید گرفت.\n" +
                    "\n" +
                    "حقیقت مهم درباره قانون ارتعاش :چیزی که باید در مورد ارتعاش بدانیم این است که ارتعاش فقط در مورد فکر کردن به اراده نیست، بلکه برای یکی شدن با هدف و میل است. وقتی فقط به آنچه می خواهید فکر می کنید و هیچ کار دیگری نمی کنید، صرفاً فکر می کنید، نه مطابق با آنچه می خواهید و آنچه می خواهید.\n" +
                    "مثلاً اگر می خواهید ارتعاشی از ثروت بفرستید و ثروتمند شوید، باید در مسیر آن آرزو بروید و ویژگی های آن آرزو را داشته باشید و فقط به فکر پول و ثروت کافی نیست.\n" +
                    "شما باید ویژگی هایی ایجاد کنید که با ثروت سازگار باشد. یک مرد ثروتمند هرگز نگران این نیست که پولش تمام شود یا احساس بدی در مورد خرج کردن پول داشته باشد.\n" +
                    "اگر رفتار بدی داشته باشید، با میل به ثروت همخوانی ندارید و ثروت را از زندگی خود می برید. یا اگر بخواهیم مثال دیگری بزنیم می توان به آرامش اشاره کرد. اگر آرزوی شما آرامش است، باید تمام وجودتان سرشار از آرامش باشد. اگر در زندگی خود رفتارهای استرس زا انجام می دهید و سپس می خواهید آرامش داشته باشید، طبق قانون ارتعاشات مطابق خواسته های خود نیستید و مطمئناً در مسیر رسیدن به آن نیستید.\n" +
                    "فرقی نمی کند از صبح تا شب تاکید بر آرامش یا ثروت را تکرار کنید، وقتی وجودتان را در راستای خواسته هایتان قرار نمی دهید، اتفاق خاصی در زندگی شما نمی افتد و به خواسته هایتان نزدیک نمی شوید.\n" +
                    "دقیقاً به همین دلیل است که بسیاری از افراد پس از فیلم راز به خواسته خود نرسیدند. چون از ارتعاش آگاه نبودند و فکر می کردند که فقط از طریق تفکر می توانیم به آرزوهایمان برسیم و در نتیجه به خواسته های خود عمل نمی کنند.\n بزرگی یا کوچکی خواسته شما اصلا مهم نیست.\n" +
                    "\n" +
                    "او کم و بیش قانون جذب را نمی فهمد. بلکه میزان ارتعاش تعیین می کند که به آنچه می خواهید می رسید یا خیر. به عبارت دیگر فرقی نمی کند که پول بیشتر یا کمتر، آرامش، موفقیت و بیشتر می خواهید! اگر مطابق خواسته خود باشید، قطعا به آن خواهید رسید.\n" +
                    "طبق قانون ارتعاشات، همه چیز در جهان حرکت می کند. این انتخاب ماست که به خواسته های خود توجه کنیم و به آنها یا خواسته های ناخواسته خود معطوف شویم",
            "همانطور که قبلا ذکر شد، قانون جذب و قانون ارتعاش ارتباط نزدیکی دارند. به عبارت دیگر قانون ارتعاش قانون اولیه و قانون جذب قانون ثانویه است.\n" +
                    "طبق قانون کوانتومی، شما محدود به بدن خود نیستید، اما در واقع بسیار فراتر از بدن خود هستید. ذهن شما انرژی دارد و مدام ارتعاشات مختلفی را ارسال می کند. این ارتعاش می تواند ارتعاش ثروت یا ارتعاش فقر باشد. چه ارتعاش سلامتی باشد و چه ارتعاش بیماری و مانند آن.\n" +
                    "شما هم انرژی جذب می کنید و هم انرژی ساطع می کنید. اگر بخواهیم این موضوع را دقیق تر توضیح دهیم، چیزهایی در زندگی ما اتفاق می افتد که همان انرژی ارتعاشات ما را دارند.\n" +
                    "برای اینکه جذابیت ایجاد شود، باید با خواسته هایی که می خواهید جذب کنید نیز ارتعاش کنید. به عنوان مثال، اگر برای ارسال ثروت و هماهنگ با ثروت، ارتعاش کنید، ارتعاشات انرژی شما باعث جذب ثروت به زندگی شما می شود. \n به عبارت دیگر، تا زمانی که جذب بدون لرزش داشته باشید، به آنچه می خواهید نخواهید رسید. بلعیدن بدون لرزش منطقی نیست و اگر از این به بعد یکی از شما بپرسد قانون ارتعاش چیست؟\n" +
                    "می توانید پاسخ دهید که ارتعاش قانون اساسی است و پیش نیاز قانون جذب امیال است. \n روش های فرستادن ارتعاش مثبت\n" +
                    "\n" +
                    "با توجه به اینکه ارسال ارتعاش مثبت و بهبود احساسات برای بسیاری از افراد مشکل است، در این بخش می خواهم چند تکنیک و تمرین را به شما بگویم که با استفاده از آنها می توانید احساسات خود را خوب نگه دارید و ارتعاشات مثبت را به کائنات بفرستید.\n" +
                    "\n" +
                    "در مورد خواسته\u200Cها و آرزوهایتان صحبت کنید\n" +
                    "\n" +
                    "یکی از تکنیک هایی که می تواند به شما در استفاده صحیح از قانون ارتعاش کمک کند این است که بتوانید در مورد خواسته ها و خواسته های خود صحبت کنید. در مورد هر چیزی که می خواهید داشته باشید صحبت کنید. می توانید در مورد خواسته های خود با دوست و رفیق خود صحبت کنید.\n" +
                    "\n" +
                    "استفاده از جملات و عبارات تاکیدی مثبت\n" +
                    "\n" +
                    "تکنیک دیگری که می توانید از قانون ارتعاش برای ارسال ارتعاش و هدف مورد نظر خود به جهان هستی استفاده کنید این است که می توانید از جملات تاکیدی مثبت استفاده کنید. همانطور که در مطالب قبلی گفتیم، قدرت کلمات بسیار زیاد است. اگر بتوانید از قدرت کلام خود به درستی استفاده کنید، می توانید به هر خواسته و هدفی که دارید برسید.\n" +
                    "\n" +
                    "استفاده از تصویر سازی ذهنی و تجسم خلاق\n" +
                    "\n" +
                    "یکی از راه های ایجاد احساسات خوب در خود استفاده از تصاویر ذهنی و تجسم خلاق است. یکی از راه های استفاده از قدرت ذهن برای استفاده از قانون ارتعاش، از طریق قدرت تخیل است. با استفاده از تخیل خود می توانید قوی ترین ارتعاشات را به کائنات بفرستید.\n",
            "چه چیزی مانع فرستادن ارتعاش مثبت به کائنات می شود؟\n" +
                    "\n" +
                    "تنها چیزی که مانع از ارسال ارتعاشات مثبت به خواسته ها و اهداف شما به کائنات می شود، اشتباه بودن افکار شماست. این بدان معناست که تنها دلیل ارسال یک ارتعاش مثبت به کائنات، فکر کردن به چیزهای مثبت و چیزهایی است که به شما احساس خوبی می دهد.\n" +
                    "به چیزهایی فکر کنید که به شما انگیزه و انگیزه می دهند.\n" +
                    "شما باید همیشه برای بهبود احساسات خود تلاش کنید.",
            "بسیاری از سخنرانان موفق به خصوص در حوزه قانون جذب نظیر ایسترهیکس نظریه جالبی دارند. آنها می گویند اگر انسان بتواند فقط ۱۸ ثانیه روی چیزی که واقعاً می خواهد تمرکز کند یک زنگ بزرگ در کاینات به صدا در می آید که توجه کل هستی را به سمت این شخص جلب می کند.\n" +
                    "اگر این ۱۸ ثانیه بتواند تا ۶۸ ثانیه ادامه یابد دیگر کار تمام است و کل هستی به تکاپو می افتد تا برای فکر متمرکز شده یک راه حل پیدا کند.\n" +
                    "اگر آرزوست برآورده اش کند و اگر سوال است برایش جوابی بیابد.\n" +
                    "در نگاه اول شاید این عدد ۶۸ ثانیه خیلی کم و ناچیز به نظر برسد.\n" +
                    "۶۸ ثانیه یعنی فقط یک دقیقه و هشت ثانیه و بسیاری از افراد می گویند که تمرکز به مدت ۶۸ ثانیه هیچ کاری ندارد!؟\n" +
                    "خب آیا شما هم همین طور فکر می کنید؟\n" +
                    "بسیار عالی است! امتحان کنید.\n" +
                    "خواهید دید که هنوز ۱۸ ثانیه اول رد نشده فکرتان منحرف می شود.\n" +
                    "ایده\u200Cای جدید بلافاصله از اعماق افکارتان ظاهر می شود و نجواگر درونی تان به سخن در می آْید که جدی نگیر و دست از این بازی ها بردار و به مسایل مهم تر زندگی بپرداز و …\n" +
                    "ما عادت کرده ایم و در حقیقت عادت داده شده ایم که بدون فکر و بر اساس عادت زندگی کنیم.\n" +
                    "ما صبح از خواب بر می خیزیم بدون این که فقط ۶۸ ثانیه برای کارهای روزانه وقت بگذاریم شروع می کنیم به خوردن صبحانه و سر کار رفتن.\n" +
                    "بدون اینکه ۶۸ ثانیه مستمر ناقابل برای ارزیابی کارهایمان وقت بگذاریم اسب سرکش ذهن را به این سو و آن سو می تازانیم تا ظهر شود و ناهاری بخوریم و استراحتی و بعد دوباره کار و سپس شب و دور هم جمع شدن و تلویزیون دیدن و بعد خوابیدن.\n" +
                    "هر ساعت ۶۰ دقیقه است و شبانه روز شامل هزار و چهارصد و چهل دقیقه است اما ما خیلی مواقع در این ۱۴۴۰ دقیقه شبانه روزمان نمی توانیم ۶۸ ثانیه روی یک موضوع خاص فکرمان را متمرکز کنیم!!\n" +
                    "به راستی این فکر پر جست و خیز که نمی تواند ۶۸ ثانیه آرام بگیرد به چه دردی می خورد؟!\n" +
                    "فکر پریشان و ناآرام چیزی جز بی قراری و آشفتگی به همراه ندارد.\n" +
                    "پیر و جوان و زن و مرد هم نمی شناسد.\n" +
                    "فکری که نتواند آرام گیرد و چند لحظه ای روی موضوعی که صاحب فکر صلاح می داند متمرکز شود، مطمئناً به هنگام نیاز و بحران که تمرکز بیشتر لازم است، کارآیی ندارد و فلج می شود.\n" +
                    "باید همین الان هر کاری که داریم زمین بگذاریم و به سراغ ذهن ناآرام خود برویم و ۶۸ ثانیه آن را مهار کنیم.\n" +
                    "۶۸ ثانیه به شرایطی که الان در آن قرار داریم بیندیشیم.\n" +
                    "۶۸ ثانیه بعد به این که واقعا در زندگی چه می خواهیم فکر کنیم.\n" +
                    "۶۸ ثانیه بعد به خوشبختی های خودمان بیندیشیم و ۶۸ ثانیه دیگر به این فکر کنیم که چقدر آرام می شویم وقتی روی مسائل زندگی خودمان با آرامش فکر می کنیم.\n" +
                    "کاینات بیرون از بدن ما گوش به فرمان ماست تا هر چه را می خواهیم به او ابلاغ کنیم.\n" +
                    "اما به یک شرط و آن این است که موقع دستور دادن این طرف و آن طرف نپریم.\n" +
                    "۶۸ ثانیه یک جا بایستیم و صریح و شفاف بگوییم چه می خواهیم.\n" +
                    "آن وقت می بینی که می توانی …\n" +
                    "\n" +
                    "⏰ قانون قدرتمند 68ثانیه."


    );

    public static List<String> summaries = Arrays.asList(
            "قبل از اینکه وارد دنیای قانون جذب شوید باید بدانید که میتوانید آن را در زندگیتان بکارببرید و این میتواند از راه صحیح به زندگی شما تاثیربگذارد.",
            "کارهای فیزیکدانان کوانتوم در سالهای اخیر، کمک زیادی به تاثیرات باورنکردنی قدرت ذهن در زندگیمان و به طور کلی در جهان کرده است. ",
            "هر انسانی به واسطه گفتار، رفتار و افکارش یک سری فرکانس از خود ساطع می کند ( قانون فرکانس ) که سبب ورود آن به جهان های فرکانسیکی می شود و",
            "در قرآن کریم نیز آیات بسیاری در خصوص قانون فرکانس بیان شده که در ادامه به چند مورد اشاره می کنیم:\n" +
                    "۱ – آیه ۲۶ سوره نور که می فرماید:",
            "همان طور که گفتیم باورهای زیادی در خصوص قانون فرکانس بیان شده است. یکی دیگر از این باورها به باورهای مالی و مسائل مربوط به آن اشاره دارد. اگر شخصی به این فکر باشد که ",
            "انرژی تمام نمی شود. زیاد یا کم هم نمی شود. از حالتی به حالت دیگر در می آید. آیا غذایی که می خوریم انرژی خوبی دارد یا بد؟ آدم های اطراف مان چه طور؟ انرژی می دهند یا انرژی می گیرند؟ ",
            " راه های مختلفی برای اندازه گیری انرژی وجود دارد. اولین تعریف را اینشتین ارائه کرد : ” هر چیزی در زندگی یعنی ارتعاش.” و قانون معروف خود را در مورد اندازه گیری انرژی ارائه کرد.",
            "آن چه رابین می گوید حداقل با علم امروز جور در می آید. همه چیز از مولکول تشکیل شده است و مولکول ها دارای الکترون هایی هستند که",
            "قانون ارتعاش یکی از مهم ترین قوانین هستی است که با استفاده از آن می توانید از قانون ارتعاش برای رسیدن به تمام خواسته ها و آرزوهای خود استفاده کنید.",
            "حتما همه شما این برج را در نزدیکی خانه خود دیده اید، این برج مخابراتی است که امواج ارتباطی بین تلفن های همراه را ارسال می کند.",
            "ارتعاش ساطع شده از دکل های مخابراتی برخی از محدودیت های فوق را دارد. مانند کاهش برق در فواصل طولانی از تاسیسات. از موانع عبور نکنید و …",
            " مواقع بسیاری پیش آمده که چیزی را در زندگیتان نمی خواستید، یا از آن فراری بوده اید یا در مقابل آن مقاومت می کردید اما بالاخره دچارش شدید، نمی خواستید مریض شوید که اتفاق افتاد",
            "آیا با قانون جذب میتوان به خواسته ها رسید ؟ جواب یک کلمه است : بله\n" +
                    "آیا میتوان به خواسته ها نرسید؟ باز هم بله.",
            "قبل از اینکه با قانون ارتعاش در قانون جذب آشنا شوید بهتر است شما را با قانون جذب آشنا کنم.",
            "همانطور که قبلا ذکر شد، قانون جذب و قانون ارتعاش ارتباط نزدیکی دارند. به عبارت دیگر قانون ارتعاش قانون اولیه و قانون جذب قانون ثانویه است.",
            "تنها چیزی که مانع از ارسال ارتعاشات مثبت به خواسته ها و اهداف شما به کائنات می شود، اشتباه بودن افکار شماست. این بدان معناست که تنها دلیل ارسال یک ",
            "بسیاری از سخنرانان موفق به خصوص در حوزه قانون جذب نظیر ایسترهیکس نظریه جالبی دارند. آنها می گویند اگر انسان بتواند فقط ۱۸ ثانیه روی چیزی که واقعاً می خواهد تمرکز کند ...");

    public static List<String> essayImages = Arrays.asList("https://files.virgool.io/upload/users/357899/posts/ku4kazkwyr75/jgbkvc5wrupe.jpeg"
            , "https://www.uplooder.net/img/image/76/0674aa9a77d686c6de4797af24bdcf88/since.jpg",
            "https://www.uplooder.net/img/image/52/43f6c1f092f060d36b91396499887a5f/frecan.jpg",
            "https://sookhtejet.com/wp-content/uploads/2019/11/%D9%82%D8%A7%D9%86%D9%88%D9%86-%D8%AC%D8%B0%D8%A8-%D8%AF%D8%B1-%D9%82%D8%B1%D8%A2%D9%86.jpg",
            "https://parvaresheafkar.com/wp-content/uploads/2018/04/money-meditation-FI.jpg",
            "https://www.uplooder.net/img/image/41/96d6a533990969ce3a6bad6103cd9bca/energies.jpg",
            "https://arshiyan.com/blog/wp-content/uploads/2020/05/3d-medical-background-with.jpg",
            "https://static4.donya-e-eqtesad.com/thumbnail/iQikhQe88uX1/R28i_ZTFGKw,/32+%2812%29.jpg",
            "https://www.uplooder.net/img/image/67/dfdc220e30ed06e63927a1b6eab92a51/erteash.jpg",
            "https://www.uplooder.net/img/image/27/d4cd2ade5bd4d8f8eafd4417a7ab5763/diffrents.jpg",
            "https://www.uplooder.net/img/image/27/d4cd2ade5bd4d8f8eafd4417a7ab5763/diffrents.jpg",
            "https://media.sedayebourse.ir/d/old/larg/1396/10/20/IMG16233365.jpg",
            "https://parvaresheafkar.com/wp-content/uploads/2018/06/dream.jpg",
            "https://parvaresheafkar.com/wp-content/uploads/2019/07/Super-brain.jpg",
            "https://parvaresheafkar.com/wp-content/uploads/2019/07/Super-brain.jpg",
            "https://www.chetor.com/wp-content/uploads/2019/07/life-obstacles-compressor-1.jpg",
            "https://d6ce0no7ktiq.cloudfront.net/images/preview/2015/06/23/design-4333/template-sticker-600x600.png");

    public static List<Integer> aquaPalate = Arrays.asList(R.color.aqua, R.color.aquad1, R.color.aquad2, R.color.aquad3, R.color.aquad4, R.color.aquad5, R.color.aquad6, R.color.aquad7);

    public static List<Integer> aquaPalateP = Arrays.asList(R.color.aquaP, R.color.aquad1P, R.color.aquad2P, R.color.aquad3P, R.color.aquad4P, R.color.aquad5P, R.color.aquad6P, R.color.aquad7P);

    public static void playClick(Context context) {
        if (readAppSetting(context, "clickSound").equals("on")) {
            final MediaPlayer player = MediaPlayer.create(context, R.raw.tap_sound);
            player.start();
        }
    }
}
